import { Fab } from "@kit/fab";
import { Card } from "@kit/card";
import { SvgIcon } from "@kit/svg-icon";
import { IcClose } from "@feature/kits/common/icons";
import { useModalHandler } from "@utils/modal-handler/config";

const SignUpRules = () => {
  // handle modal
  const hideModal = useModalHandler((state) => state.hideModal);

  return (
    <Card
      color={"white"}
      className="flex max-h-[100vh] w-full flex-col overflow-y-auto px-9 pb-9 pt-7 md:max-h-[93vh] md:w-[60vw] lg:w-[50vw]"
    >
      <div className="mb-7 flex flex-row items-center justify-between">
        <h6 className="text-[18px] font-bold">
          قوانین و مقررات استفاده از سامانه مرکز خدمات آزمایشگاهی دانشگاه صنعتی
          شریف
        </h6>

        <Fab className="bg-error-light bg-opacity-60 p-1" onClick={hideModal}>
          <SvgIcon fillColor={"black"}>
            <IcClose />
          </SvgIcon>
        </Fab>
      </div>
      <div className="flex flex-col gap-2 text-justify text-[14px] leading-loose">
        <div>
          <p>
            کاربر گرامی لطفاً موارد زیر را جهت استفاده بهینه از خدمات سامانه
            مرکز خدمات آزمایشگاهی دانشگاه صنعتی شریف به دقت ملاحظه فرمایید.
          </p>
          <p>
            ورود کاربران به سامانه مرکز خدمات آزمایشگاهی دانشگاه صنعتی شریف
            (&quot;مرکز&quot;) و ثبت درخواست در هر زمان به معنی پذیرفتن کامل
            کلیه شرایط و قوانین آن از سوی کاربر است. سامانه، با تاکید بر احترامی
            که برای حریم شخصی کاربران قائل است، برای ثبت درخواست یا استفاده از
            برخی امکانات سامانه، اطلاعاتی را از کاربران درخواست می‌کند تا بتواند
            خدماتی امن و مطمئن را به کاربران ارائه دهد. حفظ و نگهداری رمز عبور و
            نام کاربری بر عهده کاربران است. کاربران نباید این اطلاعات را برای
            شخص دیگری فاش کنند. در صورت واگذاری شماره همراه، باید شماره جدیدی در
            پروفایل ثبت شود.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">تعاریف کلیدی</h6>
          <p className="flex flex-row items-center gap-[6px] font-semibold italic">
            <div className={`h-[6px] w-[6px] rounded-full bg-common-black`} />
            تعریف سامانه:
          </p>
          <p>
            &quot;سامانه&quot; به مجموعه صفحات و محتوای آنلاین تحت دامنه
            &quot;lims.labs.sharif.ir&quot; اشاره دارد که توسط مرکز خدمات
            آزمایشگاهی دانشگاه صنعتی شریف مدیریت و ارائه می‌شود.
          </p>
          <p className="flex flex-row items-center gap-[6px] font-semibold italic">
            <div className={`h-[6px] w-[6px] rounded-full bg-common-black`} />
            تعریف مشتری یا کاربر:
          </p>
          <p>
            &quot;مشتری یا کاربر&quot; به هر شخص حقیقی یا حقوقی اشاره دارد که از
            امکانات سامانه خدمات آزمایشگاهی دانشگاه صنعتی شریف استفاده می‌کند.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">قوانین عمومی</h6>
          <p>
            توجه داشته باشید کلیه اصول و رویه‏‌های سامانه مرکز خدمات منطبق با
            قوانین جمهوری اسلامی ایران، قانون تجارت الکترونیک و قانون حمایت از
            حقوق مصرف کننده است و متعاقبا کاربر نیز موظف به رعایت قوانین مرتبط
            با کاربر است. در صورتی که در قوانین مندرج، رویه‏‌ها و خدمات سامانه
            مرکز خدمات تغییراتی در آینده ایجاد شود، در همین صفحه منتشر و به روز
            رسانی می‌شود و شما توافق می‏‌کنید که استفاده مستمر شما از سایت به
            معنی پذیرش هرگونه تغییر است.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">سیاست‏‌های رعایت حریم شخصی</h6>
          <p>
            مرکز خدمات آزمایشگاهی دانشگاه صنعتی شریف به اطلاعات خصوصی اشخاصى که
            از خدمات سایت استفاده می‏‌کنند، احترام گذاشته و از آن محافظت
            می‏‌کند. مرکز متعهد می‌شود در حد توان از حریم شخصی شما دفاع کند و در
            این راستا، تکنولوژی مورد نیاز برای هرچه مطمئن‏‌تر و امن‏‌تر شدن
            استفاده شما از سایت را توسعه دهد. در واقع با استفاده از سایت مرکز،
            شما رضایت خود را از این سیاست نشان می‏‌دهید.
          </p>
          <p>
            همه مطالب در دسترس از طریق سامانه مرکز، مانند لوگو، علائم تجاری،
            متن، توضیحات، گرافیک، آرم، تصاویر و کپی، داده‌ها و کلیه محتوای تولید
            شده توسط مرکز خدمات آزمایشگاهی جزئی از اموال این مرکز محسوب می‏‌شود
            و حق استفاده و نشر تمامی مطالب موجود و در دسترس در انحصار مرکز است و
            هرگونه استفاده بدون کسب مجوز کتبی، حق پیگرد قانونی را برای مرکز
            خدمات آزمایشگاهی دانشگاه شریف محفوظ می‏‌دارد.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">ثبت و پردازش درخواست</h6>
          <p>
            روز کاری به معنی روز شنبه تا چهار شنبه هر هفته، به استثنای تعطیلات
            عمومی در ایران است و کلیه سفارش‏‌های ثبت شده در طول روزهای کاری
            پردازش می‌‏شوند.
          </p>
          <p>
            سامانه مرکز خدمات به مشتریان خود در 7 روز هفته و 24 ساعت در روز
            امکان ثبت درخواست می‌‏دهد ولیکن از ساعت 7:30 صبح الی 15:30 بعد از
            ظهر روزهای کاری ، امکان پاسخگویی، ثبت، پیگیری و ارسال نتایج می‌باشد.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">
            راهنمایی و مشاوره برای ثبت درخواست
          </h6>
          <p>
            به منظور رفاه حال مشتریان عزیز امکان پاسخگویی به سوالات شما عزیزان
            در خصوص ثبت درخواست و ... از طریق ثبت تیکت فراهم آورده است . همچنین
            شما می توانید با تلفن{" "}
            <a href="tel:02166166246" className="text-common-gray underline">
              ۰۲۱۶۶۱۶۶۲۴۶
            </a>{" "}
            در ساعات کاری 7:30 تا 15:30 در ارتباط باشید.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">
            استفاده از اطلاعات برای ارتباط با مشتریان و بازاریابی
          </h6>
          <p>
            مرکز خدمات ممکن است برای ارتباط با مشتریان، بهینه‌سازی محتوای سامانه
            و تحقیقات بازاریابی از برخی اطلاعات استفاده کند و برای اطلاع‌رسانی
            رویدادها و اخبار، خدمات و سرویس‌های ویژه یا پروموشن‌ها، برای اعضای
            سامانه ایمیل یا پیامک ارسال نماید.
          </p>
        </div>
        <div className="pt-2">
          <h6 className="text-[15px] font-bold">تغییرات در شرایط و ضوابط</h6>
          <p>
            مرکز حق دارد هر زمان که لازم بداند، شرایط و ضوابط استفاده از سامانه
            را تغییر دهد. این تغییرات از زمان اعلام رسمی بر روی سامانه
            لازم‌الاجرا خواهند بود. کاربران موظف به دنبال کردن و آگاهی از این
            تغییرات هستند. عدم آگاهی یا پیگیری این تغییرات توسط کاربران،
            نمی‌تواند به عنوان دلیلی برای عدم پایبندی به قوانین جدید مورد استناد
            قرار گیرد.
          </p>
        </div>
      </div>
    </Card>
  );
};
export default SignUpRules;
