export const data = {
  id: 1,
  user: {
    fullname: "نیما سلمانی",
    phone: "+989106942198",
    email: "nimasalmani2001@gmail.com",
  },
  test: {
    name: "شفاف سازی و تصویر برداری نمونه‌های نانومتری(x-RAY)",
    track: "14021029-200-122",
  },
  samples: [
    {
      name: "نمونه -1",
      id: 1,
    },
    {
      name: "نمونه -2",
      id: 2,
    },
    {
      name: "نمونه -3",
      id: 3,
    },
    {
      name: "نمونه -4",
      id: 4,
    },
  ],
  request_paramaters: [
    {
      name: "پارامتر اول",
      title: "عنوان پارامتری که انتخاب کرده",
    },
    {
      name: "پارامتر دوم",
      title: "عنوان پارامتری که انتخاب کرده",
    },
    {
      name: "پارامتر سوم",
      title: "عنوان پارامتری که انتخاب کرده",
    },
    {
      name: "پارامتر چهارم",
      title: "عنوان پارامتری که انتخاب کرده",
    },
  ],
  attachments: {
    articles: [
      {
        id: 1,
        image: "",
      },
      {
        id: 2,
        image: "",
      },
    ],
    sample_images: ["", "", ""],
  },
};

export const sample_data = {
  name: "نام که انتخاب میشه و یا کاربر وارد میکنه",
  structure: "ساختاری  که انتخاب میشه و یا کاربر وارد میکنه",
  material: "جنش نمونه ای که انتخاب میشه و یا کاربر وارد میکنه",
  type: "نوع نمونه ای  که انتخاب میشه و یا کاربر وارد میکنه",
  maintenance: "شراطی  که انتخاب میشه و یا کاربر وارد میکنه",
};
