export const days = [
    {},
    {
        name: "شنبه",
        date : "20/آبان/1402"
    },
    {
        name: "یک شنبه",
        date : "20/آبان/1402"
    },
    {
        name: "دوشنبه",
        date : "20/آبان/1402"
    },
    {
        name: "سه شنبه",
        date : "20/آبان/1402"
    },
    {
        name: "چهار شنبه",
        date : "20/آبان/1402"
    },
    {
        name: "پنج شنبه",
        date : "20/آبان/1402"
    },
]

export const times = 
    {
        "08:00" : [
            {
                day: "شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "یک شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                        
                    }
                ]
            },
            {
                day: "دو شنبه",
                times: [
                    {
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "سه شنبه",
                times: [
                    {
                        
                    },
                    {
                        
                    }
                ]
            },
            {
                day: "چهار شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "پنج شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                       
                    }
                ]
            }
        ],
        "09:00" : [
            {
                day: "شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    },
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "یک شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                        
                    },
                     {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "دو شنبه",
                times: [
                    {
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    },
                     {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "سه شنبه",
                times: [
                    {
                        
                    },
                    {
                        
                    },
                     {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "چهار شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    },
                     {
                        
                    },
                    {
                       
                    }
                ]
            },
            {
                day: "پنج شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                       
                    },
                     {
                        
                    },
                    {
                        
                    }
                ]
            }
        ],
        "10:00" : [
            {
                day: "شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "یک شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                        
                    }
                ]
            },
            {
                day: "دو شنبه",
                times: [
                    {
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "سه شنبه",
                times: [
                    {
                        
                    },
                    {
                        
                    }
                ]
            },
            {
                day: "چهار شنبه",
                times: [
                    {
                        
                    },
                    {
                        traked: "324232342342",
                        time : "08:30",
                        name : "حسین احمدلو"
                    }
                ]
            },
            {
                day: "پنج شنبه",
                times: [
                    {
                        traked: "324232342342",
                        time : "08:00",
                        name : "حسین احمدلو"
                    },
                    {
                       
                    }
                ]
            }
        ],
}
